In [1]:
import pandas as pd

import seaborn as sns
import matplotlib.pyplot as plt

import sys
sys.path.insert(1, '../src/')
from titanic import *

In [2]:
# importing data sets from kernel 

train = pd.read_csv('../data/raw/train.csv')
test = pd.read_csv('../data/raw/test.csv')
print('     In Training Set:')
identify_blanks(train)
print('     In Test Set:')
identify_blanks(test)
train.head()

     In Training Set:
column PassengerId has 0 missing values.  0%
column Survived has 0 missing values.  0%
column Pclass has 0 missing values.  0%
column Name has 0 missing values.  0%
column Sex has 0 missing values.  0%
column Age has 177 missing values.  19%
column SibSp has 0 missing values.  0%
column Parch has 0 missing values.  0%
column Ticket has 0 missing values.  0%
column Fare has 0 missing values.  0%
column Cabin has 687 missing values.  77%
column Embarked has 2 missing values.  0%
     In Test Set:
column PassengerId has 0 missing values.  0%
column Pclass has 0 missing values.  0%
column Name has 0 missing values.  0%
column Sex has 0 missing values.  0%
column Age has 86 missing values.  20%
column SibSp has 0 missing values.  0%
column Parch has 0 missing values.  0%
column Ticket has 0 missing values.  0%
column Fare has 1 missing values.  0%
column Cabin has 327 missing values.  78%
column Embarked has 0 missing values.  0%

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Fill missing data

In [3]:
df = one_hot_age_gender(train)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Boy,Girl,Man,Woman
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,0,0,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,0,0,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,0,1,0

In [6]:
m = len(df.loc[df['Man'] == 1])
w = len(df.loc[df['Woman'] == 1])
b = len(df.loc[df['Boy'] == 1])
g = len(df.loc[df['Girl'] == 1])
tot = m + w + b + g
print(f'Total Men:   {m}')
print(f'Total Woman: {w}')
print(f'Total Men:   {b}')
print(f'Total Woman: {g}')
print(f'All Records: {tot}')
len(df)

Total Men:   533
Total Woman: 235
Total Men:   44
Total Woman: 79
All Records: 891

891